<script setup lang="ts">
useHead({ title: '介绍' });
definePageMeta({ headerText: '介绍' });
</script>

<template>
    <div class="article"> <p>Oiolosse服务器是专为Minecraft Java版玩家精心打造的游戏社区</p>
<p>我们致力于营造一个<strong>安全</strong>、<strong>友好</strong>且<strong>充满乐趣</strong>的游戏氛围。无论你是初出茅庐的新手还是经验丰富的老玩家，这里<strong>都有你的一席之地</strong>。我们的管理层秉持着互信的原则，<strong>热情欢迎</strong>每一位新成员，确保每位玩家都能享受到<strong>难忘</strong>的游戏时光</p>
<div id="list">
<ol>
    <li>尊重他人<ul>
            <li>尊重所有玩家： 请尊重其他玩家，避免使用侮辱性语言或进行任何形式的骚扰。</li>
            <li>公平竞争： 禁止使用任何形式的作弊、黑客工具或非法手段获取优势。</li>
        </ul>
    </li>
    <li>服务器资源使用<ul>
            <li>合理利用资源： 请合理使用服务器资源，避免过度消耗或浪费。</li>
            <li>禁止恶意破坏： 禁止恶意破坏其他玩家的建筑或红石电路。</li>
        </ul>
    </li>
    <li>建筑与领土<ul>
            <li>领土保护： 玩家可以在自己的领土内自由建造，但不得侵犯他人领土。</li>
            <li>建筑标准： 建筑应符合服务器的美学和功能标准，避免影响服务器的整体美观。</li>
        </ul>
    </li>
    <li>红石电路与技术<ul>
            <li>技术分享： 鼓励玩家分享红石电路设计和技巧，促进社区技术进步。</li>
            <li>技术限制： 禁止使用任何可能破坏服务器稳定性的红石电路设计。</li>
        </ul>
    </li>
    <li>经济与交易<ul>
            <li>公平交易： 所有交易应基于公平和自愿的原则，禁止强迫交易或欺诈行为。</li>
            <li>资源管理： 服务器内的公共资源应妥善管理，避免滥用。</li>
        </ul>
    </li>
    <li>服务器活动<ul>
            <li>活动参与： 服务器会定期举办各种活动，鼓励玩家积极参与。</li>
            <li>活动规则： 参与活动的玩家应遵守活动规则，尊重活动组织者和参与者。</li>
        </ul>
    </li>
    <li>服务器管理<ul>
            <li>管理员角色： 管理员负责维护服务器秩序，处理违规行为。玩家应尊重管理员的决策。</li>
            <li>违规处理： 违反规则的玩家可能会受到警告、临时禁言或永久封禁等处罚。</li>
        </ul>
    </li>
    <li>服务器安全<ul>
            <li>账号安全： 玩家应妥善保管自己的账号信息，避免泄露给第三方。</li>
            <li>服务器安全： 禁止任何可能危害服务器安全的行为，包括但不限于DDoS攻击、恶意传播服务器信息等。</li>
        </ul>
    </li>
    <li>反馈与建议<ul>
            <li>反馈渠道： 玩家可以通过指定渠道（<a
                    href="mailto:hello@mckfs.com">hello@mckfs.com</a>）向管理员反馈问题或提出建议。</li>
            <li>建议采纳： 管理员会认真考虑玩家的反馈和建议，并在必要时进行调整。</li>
        </ul>
    </li>
    <li>规则更新<ul>
            <li>规则变动： 服务器规则可能会根据实际情况进行调整，玩家应随时关注最新规则。</li>
            <li>规则解释： 对于规则的解释权归Oiolosse服务器管理团队所有。</li>
        </ul>
    </li>
</ol>
</div>
<p><strong>如果Oiolosse不能为您提供舒适体验，可以主动退服，请提前联系服主消除白名单，谢谢！</strong></p></div>
</template>

<style>

div#list{
    margin-left: 34px;
}
</style>